import { galleryItems } from './gallery-items.js';
// Change code below this line




console.log(galleryItems); // вивели галерею із зображеннями  в консоль


const galleryList = document.querySelector('.gallery'); // отримали посилання на ul class="gallery"

galleryList.addEventListener('click', onClick); // додали прослуховувач подій на список  ul

document.addEventListener('keydown', onKeyEscape); // додали прослуховувач, що реєструє подію, яка спрацьовує, коли користувач натискає Escape на клавіатурі



const gallery = galleryItems // створюємо змінну, що містить галерею зображень
  .map(        // перебираємо кожний елемент галереї і створюємо рядок з розміткою <li> для кожного елемента галереї
    item =>
      `<li class="gallery__item"><a class="gallery__link" href="${item.original}"><img class="gallery__image" src="${item.preview}"  data-source="${item.original}" alt="${item.description}"></a></li>` // додаємо зображення і атрибути до кожного елемента 
  )
  .join(''); // об'єднуємо всі рядки в один рядок

galleryList.insertAdjacentHTML('beforeend', gallery); // додаємо список з li до нашого ul

let instance; // змінна модального вікна

function onClick(event) {  // функція виконується, коли користувач клікає на елемент галереї зображень
   event.preventDefault(); // скидаємо дефолтні налаштування(завантаження зображення при кліку на нього)
  if (!event.target.classList.contains('gallery__image')) { 
    return; // перевіряємо чи клік дійсно по картинці з галереї
  } instance = basicLightbox.create(    
    ` <img src="${event.target.dataset.source}" alt="${event.target.alt}">`
  ); // якщо елемент, на який користувач натиснув, має клас "gallery__image"створюємо модальне вікно  з великим зображенням (Заміна значення атрибута src елемента <img>)

  instance.show(); // показуємо модальне вікно
}

function onKeyEscape(event) { // функція перевіряє, чи код клавіші є "Escape" 
  if (event.code === 'Escape') {
    instance.close();  // закриває вікно "instance", якщо це так
    document.removeEventListener("keydown", onKeyEscape); // видаляємо прослуховувача подій
  }
}


// =============================================

// Створи галерею з можливістю кліку по її елементах і перегляду повнорозмірного зображення у модальному вікні. Подивися демо відео роботи галереї.

// Виконуй це завдання у файлах 01-gallery.html і 01-gallery.js. Розбий його на декілька підзавдань:

// Створення і рендер розмітки на підставі масиву даних galleryItems і наданого шаблону елемента галереї.
// Реалізація делегування на ul.gallery і отримання url великого зображення.
// Підключення скрипту і стилів бібліотеки модального вікна basicLightbox. Використовуй CDN сервіс jsdelivr і додай у проект посилання на мініфіковані (.min) файли бібліотеки.
// Відкриття модального вікна по кліку на елементі галереї. Для цього ознайомся з документацією і прикладами.
// Заміна значення атрибута src елемента <img> в модальному вікні перед відкриттям. Використовуй готову розмітку модального вікна із зображенням з прикладів бібліотеки basicLightbox.
// Розмітка елемента галереї
// Посилання на оригінальне зображення повинно зберігатися в data-атрибуті source на елементі <img>, і вказуватися в href посилання. Не додавай інші HTML теги або CSS класи, крім тих, що містяться в цьому шаблоні.

// {/* <li class="gallery__item">
//   <a class="gallery__link" href="large-image.jpg">
//     <img
//       class="gallery__image"
//       src="small-image.jpg"
//       data-source="large-image.jpg"
//       alt="Image description"
//     />
//   </a>
// </li> */}

// Зверни увагу на те, що зображення обгорнуте посиланням, отже по кліку за замовчуванням користувач буде перенаправлений на іншу сторінку. Заборони цю поведінку за замовчуванням.

// Закриття з клавіатури
// УВАГА
// Наступний функціонал не обов'язковий для здавання завдання, але буде хорошою додатковою практикою.

// Додай закриття модального вікна після натискання клавіші Escape. Зроби так, щоб прослуховування клавіатури було тільки доти, доки відкрите модальне вікно. Бібліотека basicLightbox містить метод для програмного закриття модального вікна.
